
import css from "./Dashboard.module.scss";
import sprite from "../../../../assets/sprite.svg";
import TitleSection from "../../../../components/Title/Title";

const Dashboard = () => {
  return (
    <section className={css.container}>
      <TitleSection title="Расписание" />
      <div className={css.dashboard}>
        <table>
          <thead>
            <tr>
              <th>
                <svg width="32" height="32" viewBox="0 0 32 32">
                  <use xlinkHref={`${sprite}#timer`}></use>
                </svg>
              </th>
              <th>ПН</th>
              <th>ВТ</th>
              <th>СР</th>
              <th>ЧТ</th>
              <th>ПТ</th>
              <th>СБ</th>
              <th>ВС</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>08:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
            <tr>
              <td>09:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
            <tr>
              <td>10:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
            <tr>
              <td>11:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
            <tr>
              <td>12:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
            <tr>
              <td>13:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
            <tr>
              <td>14:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
            <tr>
              <td>15:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
            <tr>
              <td>16:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
            <tr>
              <td>17:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
            <tr>
              <td>18:00</td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
              <td>
                <p>Занятие 1</p>
                <p>08:00 -09:00</p>
                <p>Зал 1</p>
                <p>Тренер Тренерович</p>
              </td>
            </tr>
          </tbody>
        </table>
      </div>
    </section>
  );
};

export default Dashboard;
